espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_etampdet.h
/* Bit fields for ETAMPDET STATUS */
#define _ETAMPDET_STATUS_RESETVALUE                                               0x00000000UL                                 /**< Default value for ETAMPDET_STATUS           */
#define _ETAMPDET_STATUS_MASK                                                     0x80000003UL                                 /**< Mask for ETAMPDET_STATUS                    */
#define ETAMPDET_STATUS_CHNLRUNNING0                                              (0x1UL << 0)                                 /**< Channel0 Running Status                     */
#define _ETAMPDET_STATUS_CHNLRUNNING0_SHIFT                                       0                                            /**< Shift value for ETAMPDET_CHNLRUNNING0       */
#define _ETAMPDET_STATUS_CHNLRUNNING0_MASK                                        0x1UL                                        /**< Bit mask for ETAMPDET_CHNLRUNNING0          */
#define _ETAMPDET_STATUS_CHNLRUNNING0_DEFAULT                                     0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_STATUS            */
#define ETAMPDET_STATUS_CHNLRUNNING0_DEFAULT                                      (_ETAMPDET_STATUS_CHNLRUNNING0_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_STATUS    */
#define ETAMPDET_STATUS_CHNLRUNNING1                                              (0x1UL << 1)                                 /**< Channel1 Running Status                     */
#define _ETAMPDET_STATUS_CHNLRUNNING1_SHIFT                                       1                                            /**< Shift value for ETAMPDET_CHNLRUNNING1       */
#define _ETAMPDET_STATUS_CHNLRUNNING1_MASK                                        0x2UL                                        /**< Bit mask for ETAMPDET_CHNLRUNNING1          */
#define _ETAMPDET_STATUS_CHNLRUNNING1_DEFAULT                                     0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_STATUS            */
#define ETAMPDET_STATUS_CHNLRUNNING1_DEFAULT                                      (_ETAMPDET_STATUS_CHNLRUNNING1_DEFAULT << 1) /**< Shifted mode DEFAULT for ETAMPDET_STATUS    */
#define ETAMPDET_STATUS_LOCKSTATUS                                                (0x1UL << 31)                                /**< Lock Status                                 */
#define _ETAMPDET_STATUS_LOCKSTATUS_SHIFT                                         31                                           /**< Shift value for ETAMPDET_LOCKSTATUS         */
#define _ETAMPDET_STATUS_LOCKSTATUS_MASK                                          0x80000000UL                                 /**< Bit mask for ETAMPDET_LOCKSTATUS            */
#define _ETAMPDET_STATUS_LOCKSTATUS_DEFAULT                                       0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_STATUS            */
#define _ETAMPDET_STATUS_LOCKSTATUS_UNLOCKED                                      0x00000000UL                                 /**< Mode UNLOCKED for ETAMPDET_STATUS           */
#define _ETAMPDET_STATUS_LOCKSTATUS_LOCKED                                        0x00000001UL                                 /**< Mode LOCKED for ETAMPDET_STATUS             */
#define ETAMPDET_STATUS_LOCKSTATUS_DEFAULT                                        (_ETAMPDET_STATUS_LOCKSTATUS_DEFAULT << 31)  /**< Shifted mode DEFAULT for ETAMPDET_STATUS    */
#define ETAMPDET_STATUS_LOCKSTATUS_UNLOCKED                                       (_ETAMPDET_STATUS_LOCKSTATUS_UNLOCKED << 31) /**< Shifted mode UNLOCKED for ETAMPDET_STATUS   */
#define ETAMPDET_STATUS_LOCKSTATUS_LOCKED                                         (_ETAMPDET_STATUS_LOCKSTATUS_LOCKED << 31)   /**< Shifted mode LOCKED for ETAMPDET_STATUS     */

/* Bit fields for ETAMPDET EM4WUEN */
#define _ETAMPDET_EM4WUEN_RESETVALUE                                              0x00000000UL                                  /**< Default value for ETAMPDET_EM4WUEN          */
#define _ETAMPDET_EM4WUEN_MASK                                                    0x00000003UL                                  /**< Mask for ETAMPDET_EM4WUEN                   */
#define ETAMPDET_EM4WUEN_CHNLEM4WUEN0                                             (0x1UL << 0)                                  /**< Channel0 Tampdet EM4 Wakeup Enable          */
#define _ETAMPDET_EM4WUEN_CHNLEM4WUEN0_SHIFT                                      0                                             /**< Shift value for ETAMPDET_CHNLEM4WUEN0       */
#define _ETAMPDET_EM4WUEN_CHNLEM4WUEN0_MASK                                       0x1UL                                         /**< Bit mask for ETAMPDET_CHNLEM4WUEN0          */
#define _ETAMPDET_EM4WUEN_CHNLEM4WUEN0_DEFAULT                                    0x00000000UL                                  /**< Mode DEFAULT for ETAMPDET_EM4WUEN           */
#define ETAMPDET_EM4WUEN_CHNLEM4WUEN0_DEFAULT                                     (_ETAMPDET_EM4WUEN_CHNLEM4WUEN0_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_EM4WUEN   */
#define ETAMPDET_EM4WUEN_CHNLEM4WUEN1                                             (0x1UL << 1)                                  /**< Channel1 Tampdet EM4 Wakeup Enable          */
#define _ETAMPDET_EM4WUEN_CHNLEM4WUEN1_SHIFT                                      1                                             /**< Shift value for ETAMPDET_CHNLEM4WUEN1       */
#define _ETAMPDET_EM4WUEN_CHNLEM4WUEN1_MASK                                       0x2UL                                         /**< Bit mask for ETAMPDET_CHNLEM4WUEN1          */
#define _ETAMPDET_EM4WUEN_CHNLEM4WUEN1_DEFAULT                                    0x00000000UL                                  /**< Mode DEFAULT for ETAMPDET_EM4WUEN           */
#define ETAMPDET_EM4WUEN_CHNLEM4WUEN1_DEFAULT                                     (_ETAMPDET_EM4WUEN_CHNLEM4WUEN1_DEFAULT << 1) /**< Shifted mode DEFAULT for ETAMPDET_EM4WUEN   */

/* Bit fields for ETAMPDET CHNLSEEDVAL0 */
#define _ETAMPDET_CHNLSEEDVAL0_RESETVALUE                                         0x00000000UL                                       /**< Default value for ETAMPDET_CHNLSEEDVAL0     */
#define _ETAMPDET_CHNLSEEDVAL0_MASK                                               0xFFFFFFFFUL                                       /**< Mask for ETAMPDET_CHNLSEEDVAL0              */
#define _ETAMPDET_CHNLSEEDVAL0_CHNLSEEDVAL0_SHIFT                                 0                                                  /**< Shift value for ETAMPDET_CHNLSEEDVAL0       */
#define _ETAMPDET_CHNLSEEDVAL0_CHNLSEEDVAL0_MASK                                  0xFFFFFFFFUL                                       /**< Bit mask for ETAMPDET_CHNLSEEDVAL0          */
#define _ETAMPDET_CHNLSEEDVAL0_CHNLSEEDVAL0_DEFAULT                               0x00000000UL                                       /**< Mode DEFAULT for ETAMPDET_CHNLSEEDVAL0      */
#define ETAMPDET_CHNLSEEDVAL0_CHNLSEEDVAL0_DEFAULT                                (_ETAMPDET_CHNLSEEDVAL0_CHNLSEEDVAL0_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_CHNLSEEDVAL0*/

/* Bit fields for ETAMPDET CHNLSEEDVAL1 */
#define _ETAMPDET_CHNLSEEDVAL1_RESETVALUE                                         0x00000000UL                                       /**< Default value for ETAMPDET_CHNLSEEDVAL1     */
#define _ETAMPDET_CHNLSEEDVAL1_MASK                                               0xFFFFFFFFUL                                       /**< Mask for ETAMPDET_CHNLSEEDVAL1              */
#define _ETAMPDET_CHNLSEEDVAL1_CHNLSEEDVAL1_SHIFT                                 0                                                  /**< Shift value for ETAMPDET_CHNLSEEDVAL1       */
#define _ETAMPDET_CHNLSEEDVAL1_CHNLSEEDVAL1_MASK                                  0xFFFFFFFFUL                                       /**< Bit mask for ETAMPDET_CHNLSEEDVAL1          */
#define _ETAMPDET_CHNLSEEDVAL1_CHNLSEEDVAL1_DEFAULT                               0x00000000UL                                       /**< Mode DEFAULT for ETAMPDET_CHNLSEEDVAL1      */
#define ETAMPDET_CHNLSEEDVAL1_CHNLSEEDVAL1_DEFAULT                                (_ETAMPDET_CHNLSEEDVAL1_CHNLSEEDVAL1_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_CHNLSEEDVAL1*/

